Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: (The name of this parameter is derived from smartEnergy, which is an earlier name for CoolStep.)
it_it: (Il nome di questo parametro deriva da smartEnergy, che era un nome precedente di CoolStep).

source: 0 = Last frame of a multipacket message 1 =Intermediate packet of a multipacket message
it_it: 0 = Ultimo frame di un messaggio multipacchetto 1 = Pacchetto intermedio di un messaggio multipacchetto

source: 0 milliseconds
it_it: 0 millisecondi

source: 0: 1/2 of IRUN
it_it: 0: 1/2 di IRUN

source: 0: highest load low value: high load high value: less load
it_it: 0: carico massimo valore basso: carico elevato valore alto: carico inferiore

source: 1: 1/4 of IRUN
it_it: 1: 1/4 di IRUN

source: 2 Bytes
it_it: 2 Byte

source: 2s complement sum of message contents excluding checksum.
it_it: Sommatoria in complemento a 2 del contenuto del messaggio escluso il checksum.

source: 4-bit unsigned integer that controls an upper threshold.
it_it: Intero senza segno a 4 bit che controlla una soglia superiore.

source: 4-bit unsigned integer that sets a lower threshold.
it_it: Intero senza segno a 4 bit che imposta una soglia inferiore.

source: 72E-40451-04EN Revision A January 2021
it_it: 72E-40451-04EN Revision A January 2021- (Ita: 2025)

source: * Multipacketed data; the host may ACK/NAK only the last packet of a multi-packeted message.
it_it: * Dati multipacchetto; l'host può ACK/NAK [confermare/negare] solo l'ultimo pacchetto di un messaggio multipacchetto.

source: Figure 1-1 Host/Decoder Interconnection
it_it: Figura 1-1 Interconnessione Host/Decoder

source: Note: This command in not supported by all scanners.
it_it: Nota: Questo comando non è supportato da tutti gli scanner.

source: Acceleration – automatically as high as possible
it_it: L'accelerazione – automaticamente al massimo possibile

source: Application – works as fast as possible
it_it: L'applicazione – funziona il più velocemente possibile

source: Cheaper motor – does the job!
it_it: Motore più economico – fa il suo dovere!

source: DRV_STATUS[24] – 1: Signals StallGuard flag active
it_it: DRV_STATUS[24] – 1: Segnala il flag StallGuard attivo

source: DRV_STATUS[31] – 1: Signals motor stand still
it_it: DRV_STATUS[31] – 1: Segnala il motore fermo

source: Energy efficiency – highest at speed limit
it_it: Efficienza energetica – massima al limite di velocità

source: Energy efficiency power consumption decreased up to 75%
it_it: Efficienza energetica consumo energetico ridotto fino al 75%

source: Example:
it_it: Esempio:

source: GSTAT[1] – 1: Signals driver 1 driver error (clear by reading GSTAT)
it_it: GSTAT[1] – 1: Segnala un errore del driver 1 (cancellabile leggendo GSTAT)

source: GSTAT[0] – 1: Signals, that a reset has occurred (clear by reading GSTAT)
it_it: GSTAT[0] – 1: Segnala che si è verificato un reset (cancellabile leggendo GSTAT)

source: Hint: May be adapted to disable CoolStep during acceleration and deceleration phase by setting identical to VMAX.
it_it: Suggerimento: Può essere adattato per disabilitare CoolStep durante la fase di accelerazione e decelerazione impostandolo identico a VMAX.

source: Less or no cooling improved reliability
it_it: Raffreddamento ridotto o assente maggiore affidabilità

source: Motor – never loses steps
it_it: Il motore – non perde mai passi

source: Motor generates less heat improved mechanical precision
it_it: Il motore genera meno calore migliore precisione meccanica

source: RAMP_STAT[0] – 1: Signals stop left switch status (motion controller only)
it_it: RAMP_STAT[0] – 1: Segnala lo stato del fine-corsa sinistro (solo controller di movimento)

source: RAMP_STAT[1] – 1: Signals stop right switch status (motion controller only)
it_it: RAMP_STAT[1] – 1: Segnala lo stato del fine-corsa destro (solo controller di movimento)

source: RAMP_STAT[8] – 1: Signals target velocity reached (motion controller only)
it_it: RAMP_STAT[8] – 1: Segnala il raggiungimento della velocità target (solo controller di movimento)

source: RAMP_STAT[9] – 1: Signals target reached (motion controller only)
it_it: RAMP_STAT[9] – 1: Segnala il raggiungimento del target (solo controller di movimento)

source: SG_RESULT goes to zero when the motor stalls and the ramp generator can be programmed to stop the motor upon a stall event by enabling sg_stop in SW_MODE.
it_it: SG_RESULT va a zero quando il motore si blocca e il generatore di rampa può essere programmato per arrestare il motore in caso di stallo abilitando sg_stop in SW_MODE.

source: SGT in most cases can be tuned for a certain motion velocity or a velocity range.
it_it: SGT nella maggior parte dei casi può essere regolato per una determinata velocità di movimento o un intervallo di velocità.

source: SG_RESULT measurement has a high resolution, and there are a few ways to enhance its accuracy, as described in the following sections.
it_it: La misurazione di SG_RESULT ha un'alta risoluzione e sono disponibili alcuni modi per migliorarne l'accuratezza, come descritto nelle sezioni seguenti.

source: SGT is signed, so it can have negative or positive values.
it_it: SGT ha segno, quindi può avere valori negativi o positivi.

source: Table1-3 Field Descriptions
it_it: Tabella1-3 Descrizioni dei Campi

source: *)S: is a placeholder for the status bits SPI_STATUS
it_it: *)S: è un segnaposto per i bit di stato SPI_STATUS

source: - Absolutely no standby noise
it_it: - Assolutamente nessun rumore in standby

source: - Add 0x80 to the address Addr for write accesses!
it_it: - Aggiungere 0x80 all'indirizzo Addr per gli accessi in scrittura!

source: - All registers become reset to 0 upon power up, unless otherwise noted.
it_it: - Tutti i registri vengono azzerati all'accensione, salvo diversa indicazione.

source: - Efficient use of motor torque for acceleration and deceleration allows higher machine throughput
it_it: - L'uso efficiente della coppia del motore per l'accelerazione e la decelerazione consente una maggiore produttività della macchina

source: - Flexible ramp programming
it_it: - Programmazione flessibile delle rampe

source: - Immediate reaction to stop and stall conditions
it_it: - Reazione immediata alle condizioni di arresto e stallo

source: - Motor runs smooth and quiet
it_it: - Il motore funziona in modo fluido e silenzioso

source: - Reduced mechanical resonances yields improved torque
it_it: - Risonanze meccaniche ridotte che producono una coppia migliore

source: - Significantly improved microstepping with low-cost motors
it_it: - Microstepping notevolmente migliorato con motori a basso costo

source: - and I/O signal configuration
it_it: - e configurazione del segnale I/O

source: - global configuration
it_it: - configurazione globale

source: - global status flags
it_it: - flag di stato globali

source: - interface configuration
it_it: - configurazione dell'interfaccia

source: 0 = First time packet is sent
it_it: 0 = Primo invio del pacchetto

source: 0 = Temporary change
it_it: 0 = Modifica temporanea

source: 1.2.1 SPI Interface
it_it: 1.2.1 Interfaccia SPI

source: 1.2.2 UART Interface
it_it: 1.2.2 Interfaccia UART

source: 1.2 Control Interfaces
it_it: 1.2 Interfacce di controllo

source: 1.4.1 Integrated Motion Controller
it_it: 1.4.1 Motion Controller Integrato

source: 1.4.2 STEP/DIR Interface
it_it: 1.4.2 Interfaccia STEP/DIR

source: 1.5 StealthChop Driver
it_it: 1.5 Driver StealthChop

source: 1.6 StallGuard2 – Mechanical Load Sensing
it_it: 1.6 StallGuard2 – Rilevamento Meccanico del Carico

source: 1.8 DcStep – Load Dependent Speed Control
it_it: 1.8 DcStep – Controllo della Velocità in Base al Carico

source: 1.9 Encoder Interface
it_it: 1.9 Interfaccia Encoder

source: 15.1.1 Variable Velocity Limits TCOOLTHRS and THIGH
it_it: 15.1.1 Limiti di Velocità Variabili TCOOLTHRS e THIGH

source: 15.1.2 Small Motors with High Torque Ripple and Resonance
it_it: 15.1.2 Piccoli Motori con Elevato Ripple di Coppia e Risonanza

source: 15.1.3 Temperature Dependence of Motor Coil Resistance
it_it: 15.1.3 Dipendenza dalla Temperatura della Resistenza della Bobina del Motore

source: 15.1.4 Accuracy and Reproducibility of StallGuard2 Measurement
it_it: 15.1.4 Precisione e Riproducibilità delle Misurazioni di StallGuard2

source: 15.1 Tuning StallGuard2 Threshold SGT
it_it: 15.1 Regolazione della Soglia SGT di StallGuard2

source: 15.2 StallGuard2 Update Rate and Filter
it_it: 15.2 Frequenza di Aggiornamento e Filtro di StallGuard2

source: 15.3 Detecting a Motor Stall
it_it: 15.3 Rilevamento di uno Stallo del Motore

source: 15.4 Homing with StallGuard
it_it: 15.4 Homing con StallGuard

source: 15.5 Limits of StallGuard2 Operation
it_it: 15.5 Limiti di Funzionamento di StallGuard2

source: 15 StallGuard2 Load Measurement
it_it: 15 Misura del Carico con StallGuard2

source: 16.1 User Benefits
it_it: 16.1 Vantaggi per l'Utente

source: 16.2 Setting up for CoolStep
it_it: 16.2 Configurazione per CoolStep

source: 16.3.1 Response Time
it_it: 16.3.1 Tempo di Risposta

source: 16.3.2 Low Velocity and Standby Operation
it_it: 16.3.2 Funzionamento a Bassa Velocità e Standby

source: 16.3 Tuning CoolStep
it_it: 16.3 Tuning di CoolStep

source: 16 CoolStep Operation
it_it: 16 Funzionamento di CoolStep

source: 17 STEP/DIR Interface
it_it: 17 Interfaccia STEP/DIR

source: 18.1 STEP/DIR Mode
it_it: 18.1 Modalità STEP/DIR

source: 18.2 Motion Controller Mode
it_it: 18.2 Modalità Motion Controller

source: 18 DIAG Outputs
it_it: 18 Output DIAG

source: 19.1 User Benefits
it_it: 19.1 Vantaggi per l'Utente

source: 19.3 DcStep Integration with the Motion Controller
it_it: 19.3 Integrazione DcStep con il Motion Controller

source: 1 = Permanent change
it_it: 1 = Modifica permanente

source: 1 = Subsequent transmission attempts
it_it: 1 = Tentativi di trasmissione successivi

source: 21 Emergency Stop
it_it: 21 Arresto di emergenza

source: 24 QUICK CONFIGURATION GUIDE 105
it_it: 24 GUIDA RAPIDA ALLA CONFIGURAZIONE 105

source: 24 Quick Configuration Guide
it_it: 24 Guida Rapida Alla Configurazione

source: 25.1 Initialization Examples
it_it: 25.1 Esempi di Inizializzazione

source: 25 Getting Started
it_it: 25 Avvio Rapido

source: 27 Power-Up Reset
it_it: 27 Reset all'Accensione

source: 4.1.1 Selection of Write / Read (WRITE_notREAD)
it_it: 4.1.1 Selezione di Scrittura/Lettura (WRITE_notREAD)

source: 4.1.2 SPI Status Bits Transferred with Each Datagram Read Back
it_it: 4.1.2 Bit di stato SPI trasferiti con ogni lettura del datagramma

source: 4.1.3 Data Alignment
it_it: 4.1.3 Allineamento dei Dati

source: 4.1 SPI Datagram Structure
it_it: 4.1 Struttura del datagramma SPI

source: 4.2 SPI Signals
it_it: 4.2 Segnali SPI

source: 4.3 Timing
it_it: 4.3 Temporizzazione

source: 4 SPI Interface
it_it: 4 Interfaccia SPI

source: 6 Register Mapping
it_it: 6 Mappatura dei Registri

source: 7.1 Two Modes for Current Regulation
it_it: 7.1 Due Modalità di Regolazione della Corrente

source: Benefits are:
it_it: I vantaggi sono:

source: CURRENT SETTING AND FIRST STEPS WITH STEALTHCHOP
it_it: SETTAGGIO DELLA CORRENTE E PRIMI PASSI CON STEALTHCHOP

source: ENABLING COOLSTEP (ONLY IN COMBINATION WITH SPREADCYCLE)
it_it: ABILITAZIONE DI COOLSTEP (SOLO IN ABBINAMENTO CON SPREADCYCLE)

source: For the latest version of this guide and all guides, go to: http://www.zebra.com.
it_it: Per la versione più recente di questa guida e di tutte le guide, visitare: http://www.zebra.com.

source: Highest possible motor torque using fullstep drive - Cheaper motor does the job
it_it: Massima coppia motore possibile utilizzando l'azionamento fullstep - Un motore più economico fa il suo lavoro

source: INITIAL PROCEDURE FOR TUNING STALLGUARD SGT
it_it: PROCEDURA INIZIALE PER IL TUNING DI STALLGUARD SGT

source: If you have a problem with your equipment, contact Zebra Technologies support for your region.
it_it: In caso di problemi con l'apparecchiatura, contattare l'assistenza Zebra Technologies della propria area.

source: MOVING THE MOTOR USING THE MOTION CONTROLLER
it_it: MUOVERE IL MOTORE CON IL MOTION CONTROLLER

source: NOTATION OF R/W FIELD
it_it: NOTAZIONE DEL CAMPO R/W

source: NOTATION OF HEXADECIMAL AND BINARY NUMBERS
it_it: NOTAZIONE DEI NUMERI ESADECIMALI E BINARI

source: NOTE When decode data is transmitted as raw ASCII data, ACK/NAK handshaking does not apply even if it is enabled.
it_it: NOTA Quando i dati di decodifica vengono trasmessi come dati ASCII grezzi, l'handshake ACK/NAK non si applica anche se abilitato.

source: OPTIONAL PROCEDURE ALLOWING AUTOMATIC TUNING OF SGT
it_it: PROCEDUTA OPZIONALE CHE CONSENTE LA REGOLAZIONE AUTOMATICA DI SGT

source: SETTING UP DCSTEP
it_it: SETTAGGIO DI DCSTEP

source: SPI_STATUS – status flags transmitted with each SPI access in bits 39 to 32
it_it: SPI_STATUS – Flag di stato trasmessi con ogni accesso SPI nei bit da 39 a 32

source: TUNING STEALTHCHOP AND SPREADCYCLE
it_it: TUNING DI STEALTHCHOP E DI SPREADCYCLE

source: Table 1-1 Decoder Responses to Host Transmission (Continued)
it_it: Tabella 1-1 Risposte del Decoder alla Trasmissione dell'Host (Continua)

source: Table 1-1 Decoder Responses to Host Transmission
it_it: Tabella 1-1 Risposte del Decoder alla Trasmissione Host

source: Table 1-2 Host Responses to Decoder Transmission
it_it: Tabella 1-2 Risposte dell'Host alla Trasmissione del Decoder

source: Table 1-3 Field Descriptions (Continued)
it_it: Tabella 1-3 Descrizioni dei Campi (Continuazione)

source: Table 2-1 SSI Commands (Continued)
it_it: Tabella 2-1 Comandi SSI (continuazione)

source: Table 2-1 SSI Commands
it_it: Tabella 2-1 Comandi SSI

source: Table 2-13 Packet Format - CAPABILITIES_REQUEST
it_it: Tabella 2-13 Formato del Pacchetto - CAPABILITIES_REQUEST

source: Table 2-14 Field Descriptions - CAPABILITIES_REQUEST
it_it: Tabella 2-14 Descrizioni dei Campi - CAPABILITIES_REQUEST

source: Table 2-2 SSI Commands by Opcode (Continued)
it_it: Tabella 2-2 Comandi SSI per codice operativo (continuazione)

source: Table 2-2 SSI Commands by Opcode
it_it: Tabella 2-2 Comandi SSI per Codice Operativo

source: Table 2-3 Packet Format - ABORT_MACRO_PDF
it_it: Tabella 2-3 Formato del Pacchetto - ABORT_MACRO_PDF

source: Table 2-4 Field Descriptions - ABORT_MACRO_PDF
it_it: Tabella 2-4 Descrizioni dei Campi - ABORT_MACRO_PDF

source: Use of smaller motor less torque reserve required → cheaper motor does the job
it_it: Utilizzo di un motore più piccolo richiesta di una minore riserva di coppia → un motore più economico fa il suo lavoro

source: Very high motor velocities, in which the full sinusoidal current is not driven into the motor coils also leads to poor response.
it_it: Anche velocità del motore molto elevate, in cui l'intera corrente sinusoidale non viene trasmessa alle bobine del motore, comportano una scarsa risposta.

source: write VMAX:= 0x00123456
it_it: scrive VMAX:= 0x00123456

source: write VMAX:= 0x00ABCDEF
it_it: scrive VMAX:= 0x00ABCDEF

source: • Bold text is used to highlight the following:
it_it: • Il Grassetto viene utilizzato per evidenziare quanto segue:

source: • The SSI interface provides a means for the host to control the decoder.
it_it: • L'interfaccia SSI fornisce all'host un mezzo per controllare il decoder.

source: • Button names on a screen.
it_it: • Nomi dei pulsanti su uno schermo.

source: • Key names on a keypad
it_it: • Nomi dei tasti su una tastiera

source: • SSI is a half-duplex communication protocol.
it_it: • SSI è un protocollo di comunicazione half-duplex.

source: • Italics are used to highlight the following:
it_it: • Il corsivo viene utilizzato per evidenziare quanto segue:

source: • Action items
it_it: • Azioni

source: • Appendix A, Transaction Examples illustrate sample transactions.
it_it: • L'Appendice A, "Esempi di Transazioni", illustra delle transazioni di esempio.

source: • Appendix B, Mandatory Parameter describes the Parameter Scanning option which must be used with each product using SSI.
it_it: • L'Appendice B, "Parametro obbligatorio", descrive l'opzione di "Scansione dei Parametri" che deve essere utilizzata con ciascun prodotto che utilizza SSI.

source: • Chapter 1, Introduction to SSI provides an overview of SSI, including signal lines, protocol, and packeting information.
it_it: • Il Capitolo 1, "Introduzione a SSI", fornisce una panoramica di SSI, incluse le linee di segnale, il protocollo e le informazioni sulla trasmissione dei pacchetti.

source: • Chapter 2, SSI Commands describes each command supported by SSI.
it_it: • Il Capitolo 2, "Comandi SSI", descrive ciascun comando supportato da SSI.

source: • Chapters and sections in this and related documents
it_it: • Capitoli e sezioni di questo documento e di quelli correlati

source: • Check box and radio button names
it_it: • Nomi di check box e radio button

source: • Dialog box, window and screen names
it_it: • Nomi di finestre di dialogo, finestre e schermate

source: • Drop-down list and list box names
it_it: • Nomi di elenchi a discesa e caselle di riepilogo

source: • Lists of alternatives
it_it: • Elenchi di alternative

source: • Lists of required steps that are not necessarily sequential
it_it: • Elenchi di passaggi obbligatori non necessariamente sequenziali

source: • Model number or product name
it_it: • Numero di modello o nome del prodotto

source: • SSI is transaction-based, that is, the host commands and the decoder responds.
it_it: • SSI è basato su transazioni, ovvero l'host esegue un comando e il decoder risponde.

source: • Sequential lists (e.g., those that describe step-by-step procedures) appear as numbered lists.
it_it: • Gli elenchi sequenziali (ad esempio, quelli che descrivono procedure passo passo) vengono visualizzati come elenchi numerati.

source: • Serial number of the unit
it_it: • Numero di serie dell'unità

source: • Software type and version number
it_it: • Tipo e numero di versione del software

source: • bullets (•) indicate:
it_it: • I punti elenco (•) indicano:

source: • “User” refers to anyone using an SSI product.
it_it: • “User” si riferisce a chiunque utilizzi un prodotto SSI.

source: • “You” refers to the End User, System Administrator or Programmer using this manual as a reference for SSI
it_it: • “You” si riferisce all'Utente Finale, all'Amministratore di Aistema o al Programmatore che utilizza questo manuale come riferimento per SSI

source: → 0x2100000000 🡨 0xSS & unused data
it_it: → 0x2100000000 🡨 0xSS & dati inutilizzati

source: A 32 bit encoder counter is provided.
it_it: È disponibile un contatore encoder a 32 bit.

source: A StallGuard2 value represents the actual mechanical load for a given fixed parameter set.
it_it: Un valore di StallGuard2 rappresenta il carico meccanico effettivo per un dato set di parametri fissi.

source: A current probe on one motor coil is a good aid to find the best settings, but it is not a must.
it_it: Una sonda di corrente su una bobina del motore è un buon aiuto per trovare le impostazioni migliori, ma non è obbligatoria.

source: A dynamic range of up to factor 10 or more can be covered by DcStep without any step loss.
it_it: DcStep può coprire un intervallo dinamico fino a un fattore 10 o superiore senza alcuna perdita di passo.

source: A good SGT starting value is zero.
it_it: Un buon valore iniziale di SGT è zero.

source: A hardware reset requires cycling VCC_IO while keeping all digital inputs at a low level at the same time.
it_it: Un reset hardware richiede di ciclare VCC_IO mantenendo contemporaneamente tutti gli ingressi digitali a un livello basso.

source: A high increasing rate ensures fast reaction on change of load but a very fast might cause a small jerk.
it_it: Un'elevata velocità di aumento garantisce una rapida reazione al cambiamento di carico, ma una velocità molto elevata potrebbe causare un piccolo jerk.

source: A higher reading indicates less mechanical load.
it_it: Una lettura più alta indica un carico meccanico inferiore.

source: A higher value gives a higher sensitivity.
it_it: Un valore più alto determina una maggiore sensibilità.

source: A higher value makes StallGuard2 less sensitive and requires more torque to indicate a stall.
it_it: Un valore superiore rende StallGuard2 meno sensibile e richiede una coppia maggiore per indicare uno stallo.

source: A higher value makes StallGuard4 more sensitive and requires less torque to indicate a stall.
it_it: Un valore più alto rende StallGuard4 più sensibile e richiede meno coppia per indicare uno stallo.

source: A low decreasing rate fits best but a high decreasing rate saves more energy.
it_it: Una velocità di riduzione bassa è la soluzione migliore, ma una velocità di riduzione elevata consente di risparmiare più energia.

source: A low decreasing speed avoids oscillations of current regulation.
it_it: Una velocità di riduzione bassa evita oscillazioni nella regolazione della corrente.

source: A lower reading indicates a higher load and thus a higher load angle.
it_it: Una lettura più bassa indica un carico maggiore e quindi un angolo di carico maggiore.

source: A lower value gives a higher sensitivity.
it_it: Un valore inferiore fornisce una maggiore sensibilità.

source: A minimum of 40 SCK clock cycles is required for a bus transaction with the TMC5130A.
it_it: Per una transazione bus con il TMC5130A sono necessari almeno 40 cicli di clock SCK.

source: A minimum set of configuration data consists of acceleration and deceleration values and the maximum motion velocity.
it_it: Un set minimo di dati di configurazione è costituito dai valori di accelerazione e decelerazione e dalla velocità massima di movimento.

source: A motor with a good efficiency is best, because StallGuard2 measures the difference between the energy going into the motor and the energy used for moving mechanics.
it_it: Un motore con una buona efficienza è la scelta migliore, poiché StallGuard2 misura la differenza tra l'energia immessa nel motore e l'energia utilizzata per la meccanica in movimento.

source: A packet is a collection of bytes framed by the proper SSI protocol formatting bytes.
it_it: Un pacchetto è un insieme di byte suddivisi in byte di formattazione del protocollo SSI.

source: A programmable pre-scaler allows the adaptation of the encoder resolution to the motor resolution.
it_it: Un pre-scaler programmabile consente di adattare la risoluzione dell'encoder a quella del motore.

source: A read access querying the actual position is also shown.
it_it: Viene mostrata anche una query di accesso in lettura sulla posizione effettiva.

source: A read access request datagram uses dummy write data.
it_it: Un datagramma di richiesta di accesso in lettura utilizza dati di scrittura fittizi.

source: A safety margin of up to 50% torque is required, to compensate for unforeseen load peaks, torque loss due to resonance and aging of mechanical components.
it_it: È necessario un margine di sicurezza fino al 50% della coppia, per compensare picchi di carico imprevisti, perdite di coppia dovute a risonanza e invecchiamento dei componenti meccanici.

source: A setting in the range of 30-50kHz is good for many applications.
it_it: Un'impostazione nell'intervallo 30-50 kHz è adatta a molte applicazioni.

source: A start and stop velocity is supported as well as a second acceleration and deceleration setting.
it_it: Sono supportate una velocità di avvio e di arresto, nonché una seconda impostazione di accelerazione e decelerazione.

source: A step impulse with a low state on DIR increases the microstep counter and a high state decreases the counter by an amount controlled by the microstep resolution.
it_it: Un impulso di passo con stato basso su DIR aumenta il contatore di micropassi, mentre uno stato alto lo diminuisce di un valore controllato dalla risoluzione dei micropassi.
